/* eslint-disable no-irregular-whitespace */
/* eslint-disable no-console */

export default function sayHello() {
  console.log(
    '%c██   ██ ███████ ██      ██       ██████      ██████  ███████ ██    ██ ███████ ██       ██████  ██████  ███████ ██████  ██\n' +
      '%c██   ██ ██      ██      ██      ██    ██     ██   ██ ██      ██    ██ ██      ██      ██    ██ ██   ██ ██      ██   ██ ██\n' +
      '%c███████ █████   ██      ██      ██    ██     ██   ██ █████   ██    ██ █████   ██      ██    ██ ██████  █████   ██████  ██\n' +
      '%c██   ██ ██      ██      ██      ██    ██     ██   ██ ██       ██  ██  ██      ██      ██    ██ ██      ██      ██   ██   \n' +
      '%c██   ██ ███████ ███████ ███████  ██████      ██████  ███████   ████   ███████ ███████  ██████  ██      ███████ ██   ██ ██',
    'color: #19141c;',
    'color: #191418;',
    'color: #19141c;',
    'color: #191414;',
    'color: #191419;'
  );

  console.log(
    '%cLooks like you are interested in the code 👀\nHere is the repo to fulfill your curiosity ' +
      '%chttps://github.com/adham618/myportfolio_next\n\n' +
      "%cDon't forget to give it a star! 🌟\n\n" +
      'Buy Me a Coffee! https://www.buymeacoffee.com/adhamtarek',
    'font-family: Inter, sans-serif; font-size: 1.2rem; font-weight: 500;',
    'font-family: Inter, sans-serif; font-size: 1.2rem; font-weight: 500; color: #4ee5ae;',
    'font-family: Inter, sans-serif; font-size: 1.2rem; font-weight: 500;'
  );
}
